const WRITERS = [
    {
        id: "isahakyan",
        name: "Ավետիք Իսահակյան",
        nameEn: "Avetik Isahakyan",
        color: "#e1b12c",
        bio: "Հայ բանաստեղծ և գրող",
        photo: "avetik-isahakyan.PNG",
        events: [
            {
                id: "ai-1",
                year: 1875,
                title: "Ծնունդ",
                lat: 40.7893, lng: 43.8476, // Gyumri
                description: "Ալեքսանդրապոլում ծնվում է Ավետիք Իսահակյանը։ ..."
            },
            {
                id: "ai-2",
                year: 1882,
                title: "Կրթությունը",
                lat: 40.7993, lng: 43.8499, // Alexandrapol school
                description: "1882-1885 — Սովորում է Ալեքսանդրապոլի հայկական ծխական դպրոցում։"
            },
            {
                id: "ai-3",
                year: 1885,
                title: "Կրթությունը",
                lat: 40.7893, lng: 43.8476,
                description: "1885-1887 — Սովորում է Ալեքսանդրապոլի ռուսական դպրոցում։"
            },
            {
                id: "ai-4",
                year: 1888,
                title: "Կրթությունը",
                lat: 40.606437, lng: 43.999749,
                description: "1888 — Սովորում է Հառիճի վանքում (Շիրակ)।"
            },
            {
                id: "ai-5",
                year: 1889,
                title: "Կրթությունը",
                lat: 40.16197635321797, lng: 44.29357202253315, 
                description: "Սեպտեմբեր-Ընդունվում է Էջմիածնի Գևորգյան ճեմարանը,ծանոթանում և մտերմանում Կոմիտասի հետ։ "
            },
            {
                id: "ai-6",
                year: 1892,
                title: "Կրթությունը",
                lat: 41.700951, lng: 44.799195, 
                description: "<<Տարազ>> հանդեսում տպագրվում է Իսահակյանի <<Ծաղիկ էի նորաբողբոջ>> բանաստեղծությունը։Հեռանում է ճեմարանից։Թիֆլիսում Ծանոթանում է Թումանյանի հետ։"
            },
            {
                id: "ai-7",
                year: 1893,
                title: "Կրթությունը",
                lat: 55.80335075793473, lng: 15.252385598230287,
                description: "Ուսումը շարունակելու նպատակով ուղևորվում է Եվրոպա"
            },
            {
                id: "ai-8",
                year: 1896,
                title: "Գործունեությունը",
                lat: 40.19786850652424, lng: 44.51327050583021,
                description: "Իսահակյանը ձերբակալվում է հակացարական գործունեության համար"
            },
            {
                id: "ai-9",
                year: 1897,
                title: "Գործունեությունը",
                lat: 40.80876799079526, lng: 43.845596741613704,
                description: "Ազատվում է և վերադառնում է Ալեքսանդրապոլ"
            },
            {
                id: "ai-10",
                year: 1898,
                title: "Գործունեությունը",
                lat: 40.80976799079526, lng: 43.843596741613704,
                description: "-Լույս է տեսնում Իսահակյանի բանաստեղծությունների անդրանիկ ժողովածուն <<Երգեր ու վերքեր>> խորագրով: "
            },
            {
                id: "a11",
                year: 1898,
                title: "Գործունեությունը",
                lat: 46.47585303737119, lng: 30.717826554225606,
                description: "Գարուն-Շիրվանզադեի հետ աքսորվում է Օդեսա,ցարական ժանդարմերիայի կարգադրությամբ "
            },
            {
                id: "ai-12",
                year: 1893,
                title: "Գործունեությունը",
                lat: 55.80335075793473, lng: 15.252385598230287,
                description: "Ուսումը շարունակելու նպատակով ուղևորվում է Եվրոպա"
            },
            {
                id: "ai-13",
                year: 1899,
                title: "Գործունեությունը",
                lat: 40.29404575547056, lng: 44.605852585896564,
                description: "Վերադարձ հայրենիք"
            },
            {
                id: "ai-14",
                year: 1899,
                title: "Գործունեությունը",
                lat: 41.69236148235229, lng: 44.79848030450787,
                description: "Մասնակցում է <<Վերնատան>> ստեղծմանը"
            },
            {
                id: "ai-15",
                year: 1900,
                title: "Գործունեությունը",
                lat: 47.37508731356411, lng: 8.541195154892904,
                description: "Ցյուրիխում լսում է փիլիսոփայություն և գրականություն"
            },
            {
                id: "ai-16",
                year: 1901,
                title: "Գործունեությունը", 
                lat:45.44525549352727, lng:12.324647192504361,
                description: "Այցելում է Մխիթարյան միաբանություն"
            },
            {
                id: "ai-17",
                year: 1902,
                title: "Գործունեությունը", 
                lat: 40.4099572657879, lng: 49.860460078403,
                description: "Հրատարակվում է Իսահակյանի բանաստեղծությունների II ժողովածուն՝<<Հին-նոր երգեր ու վերքեր>> վերնագրով"
            },
            {
                id: "ai-18",
                year: 1903,
                title: "Գործունեությունը",
                lat: 41.4099572657879, lng: 49.860460078403,
                description: "Հրապարակվում է Իսահակյանի ժողովածուն <<Բանաստեղծություններ>> խորագրով,նվիրված մորը՝ Ալմաստ Իսահակյանին։"
            },
            {
                id: "ai-90",
                year: 1904,
                title: "Գործունեությունը", 
                lat: 55.761266230114465, lng: 37.631284877601146,
                description: "Այցելում է Լազարյան ճեմարան,որտեղ ծանոթանում է Տերյանի հետ։"
            },
            {
                id: "ai-19",
                year: 1906,
                title: "Գործունեությունը", 
                lat: 40.959848303918314, lng: 44.64982244402602,
                description: "Թումանյանի հետ շրջագայում են Լոռվա սարերում։ "
            },
            {
                id: "ai-20",
                year: 1907,
                title: "Գործունեությունը",
                lat: 55.861266230114465, lng: 37.631284877601146,
                description: "Լույս է տեսնում Իսահակյանի բանաստեղծությունների գրքույկը <<Цветы Араза>> վերնագրով։ "
            },
            {
                id: "ai-21",
                year: 1908,
                title: "Գործունեությունը", 
                lat: 40.408067261101856, lng: 49.84833587361979,
                description: "Ստանձնում տեղի Հայոց Կուլտուրական Միության Հրատարակչության մասի վարչի պարտականությունները։"
            },
            {
                id: "ai-22",
                year: 1908,
                title: "Գործունեությունը",
                lat: 41.69155984682776,  lng: 44.812235569827415,
                description: "Ձերբակալվում է և փակվում Թիֆլիսի Մետեխի բանտում"
            },
            {
                id: "ai-23",
                year: 1909,
                title: "Գործունեությունը",
                lat:  40.80982202214281, lng: 43.82622583468479,
                description: "Ազատվում է բանտից,ամուսնանում է Սոֆիկ Քոչարյանի հետ"
            },
            {
                id: "ai-24",
                year: 1911,
                title: "Գործունեությունը",
                lat: 41.01956329412316, lng: 28.934551666757265,
                description: "Առաջին անգամ լրիվ հրատարակվում է <<Աբու-Լալա Մահարին>>"
            },
            {
                id: "ai-25",
                year: 1912,
                title: "Գործունեությունը",
                lat:48.23682441196883, lng: 16.450470827039627,
                description: ""
            },
            {
                id: "ai-26",
                year: 1913,
                title: "Գործունեությունը",
                lat: 46.203991018450324, lng: 6.144582995565858,
                description: ""
            },
            {
                id: "ai-27",
                year: 1914,
                title: "Գործունեությունը",
                lat:52.529784768641754, lng:13.375243178633227,
                description: ""
            },
            {
                id: "ai-28",
                year: 1919,
                title: "Գործունեությունը",
                lat:40.79357359686377, lng:43.83695829627195,
                description: "Գրում է <<Սասմա Մհեր>> վիպերգը"
            },
            {
                id: "ai-29",
                year: 1920,
                title: "Գործունեությունը",
                lat: 46.303991018450324, lng: 6.144582995565858,
                description: "Ժնևում հրապարակվում է բանաստեղծությունների ժողովածուն՝<<Հայրենի աղբյուր>> խորագրով։"
            },
            {
                id: "ai-30",
                year: 1921,
                title: "Գործունեությունը",
                lat: 45.44105309435733, lng: 12.317880547658863,
                description: ""
            },
            {
                id: "ai-31",
                year: 1922,
                title: "Գործունեությունը",
                lat: 45.45105309435733, lng: 12.317880547658863,
                description: "Հրատարակվում է <<Աշնան ծաղիկներ>> ժողովածուն և <<Սասմա Մհեր>> վիպերգը"
            },
            
            {
                id: "ai-34",
                year: 1927,
                title: "Գործունեությունը",
                lat:41.735919899651236, lng:44.80797639876499,
                description: "Լույս է տեսնում <<Լիլիթ.արևելյան տեսիլներ>> ժողովածուն"
            },
            // {
            //     id: "ai-35",
            //     year: 1932,
            //     title: "Գործունեությունը",
            //     lat:48.88253709020276, lng: 2.3291778680753645,
            //     description: "Լույս է տեսնում <<>> ժողովածուն"
            // },
            {
                id: "ai-35",
                year: 1936,
                title: "Գործունեությունը",
                lat:40.173738429546596, lng:44.4851180411138,
                description: "դեկտեմբերի5 -> Երևան"
            },
            {
                id: "ai-36",
                year: 1943,
                title: "Գործունեությունը",
                lat: 40.202588604525175, lng: 44.46795190409159,
                description: "Ընտրվում է Հայկական ՀԽՍՀ գիտությունների ակադեմիայի անդամ։"
            },
            {
                id: "ai-37",
                year: 1945,
                title: "Գործունեությունը",
                lat:40.2104547042802, lng:44.42263330235296,
                description: "Պարգևատրվում է Լենինի շքանշանով։"
            },
            {
                id: "ai-38",
                year: 1946,
                title: "Գործունեությունը",
                lat:40.160095893696415, lng:44.47001184053426,
                description: "Ընտրվում է Հայաստանի Սովետական գրողների միության նախագահ:"
            },
            {
                id: "ai-39",
                year: 1949,
                title: "Գործունեությունը",
                lat:40.16219492382989, lng:44.55446923468353,
                description: "Ընտրվում է Սովետական Կոմիտեի անդամ:"
            },
            {
                id: "ai-41",
                year: 1950-1951,
                title: "Գործունեությունը",
                lat:40.13910202332243, lng:44.48580468659469,
                description: "Հրատարակվում է իր I քառահատոր <<Երկերի ժողովածուն>>։"
            },
            {
                id: "ai-40",
                year: 1957,
                title: "Մահ",
                lat:40.16182934954934, lng:44.501755951844956,
                description: "Մահացել է։Թաղված է Երևանի Կոմիտասի անվան պանթեոնում։"
            },
        ]
    },

    {
        id: "aghayan",
        name: "Ղազարոս Աղայան",
        nameEn: "Ghazaros Aghayan",
        color: "#e74c3c",
        bio: "Armenian writer and educator.",
        photo: "ղազար.jpg",
        events: [
            {
                id: "ga-1",
                year: 1840,
                title: "Ծնունդ",
                lat: 41.6938, lng: 44.8015, 
                description: "1840 թ. ապրիլի 4-ին Բոլնիս-Խաչեն (այժմ՝ Վրաստանում) հայաբնակ գյուղում ծնվել է Ղազարոս Աղայանը։"
            },
            {
                id: "ga-2",
                year: 1850,
                title: "",
                lat:41.691722519984836, lng:44.756623155629455,
                description: "Սկզբնական կրթությունը ստացել է ծննդավայրում և Շամշուլդա գյուղում՝ քահանա Տեր-Պետրոսի մոտ։"
            },
            {
                id: "ga-3",
                year: 1853,
                title: "Կրթություն",
                lat:40.65354821852695, lng:43.75163398577885,
                description: "Ընդունվել է Թիֆլիսի Ներսիսյան դպրոցը, սակայն մեկ տարի անց ինքնակամ հեռացել է։"
            },
            {
                id: "ga-4",
                year: 1862,
                title: "Գործունեության սկիզբը",
                lat:55.77832644237581, lng:37.60559595135351,
                description: "1862 թ. ուսումը շարունակելու և մասնագիտության մեջ կատարելագործվելու նպատակով ընկերոջ հետ մեկնում է Մոսկվա։"
            },
            {
                id: "ga-5",
                year: 1862,
                title: "",
                lat:59.91950218826487, lng:30.311496119358537,
                description: "1862–1867 թթ. աշխատում է որպես գրաշար Մոսկվայում և Սանկտ Պետերբուրգում։"
            },
            {
                id: "ga-6",
                year: 1860,
                title: "Վերադարձ և մանկավարժական գործունեություն",
                lat:40.34038581954844, lng:45.87816139504909,
                description: "1867 թ. վերադառնում է Հարավային Կովկաս։"
            },
            {
                id: "ga-7",
                year: 1869,
                title: "Վերադարձ և մանկավարժական գործունեություն",
                lat:41.75062897232392, lng:44.83107854496559,
                description: "1869–1870 թթ. եղել է Էջմիածնի տպարանի կառավարիչը, խմբագրել է «Արարատ» ամսագիրը։"
            },
            {
                id: "ga-8",
                year: 1870,
                title: "",
                lat:41.64166218856859, lng:42.98383694880101, // Tbilisi
                description: "1870–1882 թթ. դասավանդել է Ախալցխայի, Ալեքսանդրապոլի, Երևանի և Շուշիի դպրոցներում։"
            },
            {
                id: "ga-9",
                year: 1895,
                title: "Քաղաքական հետապնդումներ",
                lat:45.50850007531589, lng:33.39208330680139,
                description: "1895 թ. ձերբակալվել է Հնչակյան կուսակցությանը պատկանելու մեղադրանքով։Աքսորվել է Նոր Նախիջևան, ապա՝ Ղրիմ։"
            },
            {
                id: "ga-10",
                year: 1898,
                title: "Քաղաքական հետապնդումներ",
                lat:45.6853044299175, lng:34.55114087854103,
                description: "1898–1900 թթ. գտնվել է աքսորում Ղրիմում։"
            },
            {
                id: "ga-12",
                year: 1905,
                title: "Հասարակական գործունեություն",
                lat:41.67018376269904, lng:44.768296128804536,
                description: "1905 թ. մասնակցել է Թիֆլիսի հոկտեմբերյան ցույցին՝ կոչ անելով ցարի տապալմանը։"
            },
            {
                id: "ga-13",
                year: 1911,
                title: "Մահ",
                lat:41.67018376269904, lng:44.768296128804536,
                description: "1911 թ. հունիսի 20-ին մահացել է Թիֆլիսում"
            },
           
        ]
    },

    {
        id: "shant",
        name: "Լևոն Շանթ",
        nameEn: "Levon Shant",
        color: "#9b59b6",
        bio: "Armenian playwright and novelist.",
        photo: "լյով.jpg",
        events: [
            {
                id: "ls-1",
                year: 1869,
                title: "Ծնունդ",
                lat: 41.0082, lng: 28.9784, 
                description: "Լևոն Շանթը(Նահաշպետյան,Սեղբոսյան) ծնվել է 1869թ. Ապրիլի 6-ին Կ.Պոլսում՝գորգի վաճառականի ընտանիքում։"
            },
            {
                id: "ls-14",
                year: 1880,
                title: "",
                lat:41.02208775561094, lng:28.947886704416717,
                description: "Նախնական կրթություն - Սկյուտարի Սուրբ Կարապետ եկեղեցու վարժարան - Սկուտարի ճեմարան (վայր՝Կ.Պոլիս)"
            },
            {
                
                id: "ls-15",
                year: 1884,
                title: "",
                lat:40.162175547537295, lng:44.29363894020139,
                description: "Գևորգյան ճեմարան "
            },
            {
                
                id: "ls-16",
                year: 1892,
                title: "",
                lat:48.15038278288663, lng:11.567001985805375,
                description: " Լայպցիգի,Ենայի,Մյունխենի համալսարաններ "
            },
            {
                
                id: "ls-17",
                year: 1898,
                title: "",
                lat:40.33601857424753, lng:44.52067985041319,
                description: "ՎԵՐԱԴԱՐՁ ԿՈՎԿԱՍ"
            },
            {
                
                id: "ls-18",
                year: 1899,
                title: "",
                lat:41.73730852078407, lng:44.8008661438065,
                description: "Դառնում է <<Վերնատան>> հիմնադիրներից անդամներից մեկը։"
            },
            {
                
                id: "ls-19",
                year: 1900,
                title: "",
                lat:46.86500287597551, lng:8.240387427821414,
                description: "Շվեյցարիայում հանդիպում է ապագա կնոջը՝ Ջավահիր Ներսիսյանին, 1903-ին ամուսնանում։"
            },
            {
                
                id: "ls-20",
                year: 1906,
                title: "",
                lat:41.673774056217205, lng:44.83215415852716,
                description: "տեսուչ Գայանյան դպրոցում - վայր՝ Թիֆլիս Թումանյանի և Լիսիցյանի հետ հրապարակում է «Լուսաբեր» դասագիրքը։"
            },
            {
                
                id: "ls-21",
                year: 1908,
                title: "",
                lat:40.19000094630547, lng:44.478251586304914,
                description: "Որպես թեմական դպրոցի ուսուցիչ։"
            },
            {
                
                id: "ls-22",
                year: 1908,
                title: "",
                lat: 41.0082, lng: 28.9774,
                description: "Դասավանդում է Եսայան օրիորդաց և Կեդրոնական վարժարաններում:"
            },
            {
                
                id: "ls-23",
                year: 1913,
                title: "",
                lat:54.49770620136083, lng:14.549260625800546,
                description: "«Հին աստվածներ» դրամայի հաջողության շնորհիվ մեկնում է Եվրոպա, փրկվում է Եղեռնից։"
            },
            {
                
                id: "ls-24",
                year: 1918,
                title: "",
                lat:40.14015187095198, lng:44.51739037871555,
                description: "Ընտրվում է Հայաստանի առաջին Հանրապետության խորհրդարանի  փոխնախագահ։"
            },
            {
                
                id: "ls-25",
                year: 1920,
                title: "",
                lat:40.14015187095198, lng:44.52739037871555,
                description: " Բոլշևիկների հետ բանակցելու մեկնող պատվիրակության ղեկավար։"
            },
            {
                
                id: "ls-26",
                year: 1920,
                title: "",
                lat:40.14015187095198, lng:44.52639037871555,
                description: "Նույն թվականին՝ 1920 թ.-ին բանտարկվում"
            },
            {
                
                id: "ls-27",
                year: 1921,
                title: "",
                lat:35.72641626809355, lng:51.32085930265932,
                description: "դուրս է գալիս բանտից Նիկոլ Աղբալյանի հետ։Հասնում է Զանգեզուր-»Մեղրի -» Պարսկաստանի Թավրիզ քաղաք -» Թեհրան"
            },
            {
                
                id: "ls-28",
                year: 1930,
                title: "",
                lat:33.89300759629155, lng:35.50726983597706,
                description: "Նիկոլ Աղբալյանի հետ հիմնում են Համազգային հայ ճեմարանը։"
            },

            {

                id: "ls-29",
                year: 1951,
                title: "Մահ",
                lat: 33.8938, lng: 35.5018, // Beirut
                description: "Նոյեմբերի 29-ին 82 տարեկան հասակում,Բեյրութում վախճանվում է Լևոն Շանթը։"
            }
        ]
    },

    {
        id: "tumanyan",
        name: "Հովհաննես Թումանյանն",
        nameEn: "Հովհաննես Թումանյան",
        color: "#2ecc71",
        bio: "Armenian writer.",
        photo: "hovo.jfif",
        events: [
            {
                id: "dd-1",
                year: 1869,
                title: "Ծնունդ",
                lat:40.96515215572921, lng:44.65165592445659,
                description: "Հովհաննես Թումանյանը ծնվել է 1869 թվականի փետրվարի 19-ին Լոռվա Դսեղ գյուղում:"
            },
            {
                id: "dd-2",
                year: 1877,
                title: "Սկզբնական կրթություն",
                lat:40.9580873265179, lng:44.64478946964771,
                description: "Սովորել է Դսեղի ծխական դպրոցում"
            },
            {
                id: "dd-3",
                year: 1879,
                title: "Գրական առաջին փորձերը",
                lat:41.007775516092224, lng:44.376256673365006,
                description: "Սովորել է Ջալալօղլու (այժմ Ստեփանավան) նորաբաց երկսեռ դպրոցում:"
            },
            {
                id: "dd-4",
                year: 1883,
                title: "",
                lat:41.70761554970726, lng:44.917298198157326,
                description: "Սովորել է Թիֆլիսի Ներսիսյան դպրոցում:"          
            },
            {
                id: "dd-5",
                year: 1887,
                title: "Վերադարձ Թիֆլիս և ակտիվ գրականություն",
                lat:41.750660791022256, lng:44.83970725881694,
                description: "Նյութական ծանր դրության պատճառով 1887 թվականին կիսատ թողնելով ուսումը՝ աշխատել է Թիֆլիսի հայ եկեղեցական դատարանում, այնուհետև Հայ Հրատարակչական միության գրասենյակում (մինչև 1893 թ․)  "
            },
            {
                id: "dd-6",
                year: 1899,
                title: "Տեղափոխություն Հայաստան (Երևան)",
                lat:40.134377508250125, lng:44.52631676996711,
                description: "1899 թ․ բանաստեղծը կազմակերպում է «Վերնատուն» գրական խմբակը։ Հանդիպումների ժամանակ քննարկում վերլուծում էին համաշխարհային արժեք ունեցող ստեղծագործություններ, միմյանց գրվածքները և այլն։"           
            },
            // {
            //     id: "dd-7",
            //     year: 1905,
            //     title: "",
            //     lat:40.202136625689116, lng:44.50287244732561,
            //     description: "1899 թ․ բանաստեղծը կազմակերպում է «Վերնատուն» գրական խմբակը։ Հանդիպումների ժամանակ քննարկում վերլուծում էին համաշխարհային արժեք ունեցող ստեղծագործություններ, միմյանց գրվածքները և այլն։ " 
            // },
            {
                id: "dd-8",
                year: 1912,
                title: "    ",
                lat:40.17571539470449, lng:44.50541269489123,
                description: "1912-1921 թվականներին եղել է Հայ գրողների կովկասյան միության նախագահ։ Հայաստանի խորհրդայնացումից հետո նախագահել է Հայաստանի օգնության կոմիտեն:" 
            },
            {
                id: "dd-9",
                year: 1915,
                title: "    ",
                lat:40.15566731543516, lng:44.28339853511428,
                description: "Ցեղասպանության ժամանակ ստանձնում է փախստականներին օգնելու կազմակերպումը։Ղեկավարում է կոմիտեներ, որբերի տեղաբաշխում, սնունդ, բուժման կազմակերպում։" 
            },
            {
                id: "dd-11",
                year: 1918,
                title: "    ",
                lat:40.21464958423345, lng:44.47481835890048,
                description: "Մասնակցում է ազգային հարցերի լուծման աշխատանքներին։ Միաժամանակ շարունակում էգրական գործունեությունը ու թարգմանությունները։" 
            },
            {
                id: "dd-12",
                year: 1921,
                title: "    ",
                lat:41.02246778982733, lng:29.003877411953276, 
                description: "1921 թվականի աշնանը Թումանյանը մեկնել է Կոստանդնուպոլիս՝ հայ գաղթականների համար օգնություն գտնելու նպատակով։ Մի քանի ամիս մնալով այնտեղ՝ նա վերադառնում է հիվանդացած։" 
            },
            {
                id: "dd-13",
                year: 1923,
                title: "    ",
                lat:55.853002823514146, lng:37.41984324552326,
                description: "Մահացել է 1923 թվականին՝ Մոսկվայում " 
            }
        ]
    },

    {
        id: "demirchyan",
        name: "Դերենիկ Դեմիրճյան",
        nameEn: "Derenik Demirchyan",
        color: "#3498db",
        bio: "Armenian writer.",
        photo: "images.webp",
        events: [
            {
                id: "dd-1",
                year: 1877,
                title: "Ծնունդը",
                lat: 41.0775, lng: 43.4729, // Akhalkalaki
                description: "1877 թ. հունվարի 29-ին Ախալքալաքում ծնվել է Դերենիկ Դեմիրճյանը (Դեմիրճօղլյան)՝ բազմանդամ ընտանիքում։"
            },
            {
                id: "dd-2",
                year: 1882,
                title: "Սկզբնական կրթություն",
                lat: 41.0775, lng: 43.4829, // Akhalkalaki
                description: "Սովորել է Ախալքալաքի ծխական դպրոցում։ Հայկական դպրոցները ցարական կառավարության կողմից փակվելուց հետո ուսումը շարունակել է ռուսական տարրական դպրոցներում։"         
            },
            {
                id: "dd-3",
                year: 1885,
                title: "Տեղափոխություն և ուսման շարունակություն",
                lat:41.113461158875815, lng:42.702761513460146, // Tbilisi
                description: "Ընտանիքը ապրուստ հոգալու նպատակով տեղափոխվում է Արդահան։ Դերենիկ Դեմիրճյանը սովորում է տեղի ծխական դպրոցում, ստանում հայրենասիրության առաջին դասերը և կատարում գրական առաջին փորձերը։Այստեղ, Րաֆֆու «Խենթի» ազդեցությամբ, գրում է իր առաջին պատմվածքը, բանաստեղծություններ՝ հետևելով Միքայել Նալբանդյանի և Ղևոնդ Պատկանյանի օրինակին։"
            },
            {
                id: "dd-4",
                year: 1892,
                title: "Կրթություն՝ հոգևոր և աշխարհիկ",
                lat: 40.16275174411683, lng:44.290779974033825,
                description: "1892 թ. ուսումը շարունակում է Էջմիածնի Գևորգյան ճեմարանում։ Ուսումնասիրում է համաշխարհային դասականների՝ Ուիլյամ Շեքսպիրի, Յոհան Վոլֆգանգ Գյոթեի, Ալեքսանդր Պուշկինի, Հայնրիխ Հայնեի, Ջորջ Գորդոն Բայրոնի, Միխայիլ Լերմոնտովի ստեղծագործությունները։ Շարունակում է բանաստեղծական փորձերը։"
            },
            {
                id: "dd-5",
                year: 1894,
                title: "Ուսման ընդհատում և տեղափոխություն",
                lat:41.71837956398967,lng:44.788895493231195,
                description: "1894–1895 ուս. տարում, Գևորգյան ճեմարանի ուսանողական խռովության պատճառով, ուսումը ընդհատվում է։ Դեմիրճյանը մեկնում է Թիֆլիս և կրթությունը շարունակում Ներսիսյան դպրոցում, որն ավարտում է 1897 թ.։"
            },
            {
                id: "dd-6",
                year: 1897,
                title: " Գրական միջավայր և «Վերնատուն»",
                lat:41.77319678682957, lng:44.73327720927923,
                description: "Թիֆլիսում ծանոթանում է Հովհաննես Թումանյանի և Ավետիք Իսահակյանի հետ, մտերմանում նրանց հետ և դառնում Թումանյանի կազմակերպած «Վերնատուն» գրական խմբակի ակտիվ անդամներից մեկը։"
            },
            {
                id: "dd-69",
                year: 1890,
                title: "Աշխատանքային գործունեություն և կյանքի ճանաչում",
                lat:38.50099337835887, lng:43.37468641472156,
                description: "Աշխատում է Կովկասյան բարեգործական ընկերությունում, որտեղ ծանոթանում է 1896 թ. համիդյան ջարդերից հետո Մուշից, Բասենից և Վանից գաղթած մարդկանց կյանքին։"
            },
            {
                id: "dd-61",
                year: 1903,
                title: "Տեղափոխություն Բաքու",
                lat:40.44832749829987, lng:49.8517995805687,
                description: "1903 թ. տեղափոխվում է Բաքու։ Մանթաշովի գործարանում աշխատում է որպես բանվորական ճաշարանի վարիչ։ Զուգահեռաբար գրում և մամուլում հրապարակում է բանաստեղծություններ ու պատմվածքներ։"
            },
            {
                id: "dd-62",
                year: 1903,
                title: "Ուսում արտասահմանում",
                lat:38.50099337835887, lng:43.37468641472156,
                description: "1903 թ. մեկնում է Մոսկվա՝ երաժշտության դասեր ստանալու նպատակով։ Նյութական դժվարությունների պատճառով ուսումը կիսատ թողնում է։"
            },
            {
                id: "dd-63",
                year: 1905,
                title: "Ուսում արտասահմանում",
                lat:46.81171180618299, lng:7.774990069353935,
                description: "1905 թ. մեկնում է Շվեյցարիա, սովորում Ժնևի համալսարանի բնագիտության, մանկավարժության և գրականության բաժանմունքներում։"
            },
            {
                id: "dd-64",
                year: 1905,
                title: "",
                lat:46.21111889314389, lng:6.133425006837972,
                description: "1908 թ. ավարտում է համալսարանը և վերադառնում Թիֆլիս։"  
            },
            {
                id: "dd-74",
                year: 1910,
                title: "",
                lat:46.51111889314389, lng:6.133425006837972,
                description: "1910 թ-ից աշխատում է Հովնանյան օրիորդական գիմնազիայում՝ դասավանդելով հայոց լեզու և գրականություն։"  
            },
            {
                id: "dd-75",
                year: 1925,
                title: "",
                lat:40.16901632357933, lng:44.44185937581783,
                description: "1925 թ. Թիֆլիսից տեղափոխվում է Երևան:"  
            },
            {
                id: "dd-24",
                year: 1925,
                title: "",
                lat:40.26901632357933, lng:44.44185937581783,
                description: "1925–1928 թթ. զբաղվում է գրական և մշակութային ակտիվ գործունեությամբ։"  
            },
            {
                id: "dd-54",
                year: 1930,
                title: "",
                lat:40.27001632357933, lng:44.44185937581783,
                description: "1920–1930-ական թթ. գրում է պատմվածքներ, վեպեր, դրամաներ, կատակերգություններ, հրապարակախոսական և քննադատական հոդվածներ՝ արտացոլելով խորհրդահայ իրականության փոփոխությունները։"
            },
            {
                id: "dd-34",
                year: 1941,
                title: "",
                lat:40.27001632357933, lng:44.44185937581783,
                description: "Երկրորդ համաշխարհային պատերազմի տարիներին ֆաշիզմի դեմ պայքարում է գրական խոսքով՝ հրապարակախոսական հոդվածներով, պատմավեպերով և պատմվածքներով։"
            },
            {
                id: "dd-44",
                year: 1940,
                title: "",
                lat:40.37001632357933, lng:44.44185937581783,
                description: "1940 թ. արժանանում է արվեստի վաստակավոր գործչի կոչմանը։"  
            },
            {
                id: "dd-7",
                year: 1956,
                title: "Մահ",
                lat: 40.1792, lng: 44.4991, // Yerevan
                description: "1956 թ. դեկտեմբերի 6-ին մահացել է Երևանում։"
            },
            {
                id: "dd-8",
                year: 1953,
                title: "Ընտրություն Գիտությունների Ակադեմիայի ակադեմիկոս",
                lat: 40.1792, lng: 44.4991, // Yerevan
                description: "1953 թ. ընտրվում է Հայաստանի ԳԱ ակադեմիկոս"
            }
        ]
    }
];
