const WRITERS = [
    {
        id: "isahakyan",
        name: "Ավետիք Իսահակյան",
        nameEn: "Avetik Isahakyan",
        color: "#e1b12c",
        bio: "Հայ բանաստեղծ և գրող",
        photo: "avetik-isahakyan.PNG",
        events: [
            {
                id: "ai-1",
                year: 1875,
                title: "Ծնունդ",
                lat: 40.7893, lng: 43.8476, // Gyumri
                description: "Ալեքսանդրապոլում ծնվում է Ավետիք Իսահակյանը։ ..."
            },
            {
                id: "ai-2",
                year: 1882,
                title: "Կրթությունը",
                lat: 40.7993, lng: 43.8499, // Alexandrapol school
                description: "1882-1885 — Սովորում է Ալեքսանդրապոլի հայկական ծխական դպրոցում։"
            },
            {
                id: "ai-3",
                year: 1885,
                title: "Կրթությունը",
                lat: 40.7893, lng: 43.8476,
                description: "1885-1887 — Սովորում է Ալեքսանդրապոլի ռուսական դպրոցում։"
            },
            {
                id: "ai-4",
                year: 1888,
                title: "Կրթությունը",
                lat: 40.606437, lng: 43.999749,
                description: "1888 — Սովորում է Հառիճի վանքում (Շիրակ)।"
            },
            {
                id: "ai-5",
                year: 1889,
                title: "Կրթությունը",
                lat: 40.16197635321797, lng: 44.29357202253315, 
                description: "Սեպտեմբեր-Ընդունվում է Էջմիածնի Գևորգյան ճեմարանը,ծանոթանում և մտերմանում Կոմիտասի հետ։ "
            },
            {
                id: "ai-6",
                year: 1892,
                title: "Կրթությունը",
                lat: 41.700951, lng: 44.799195, 
                description: "<<Տարազ>> հանդեսում տպագրվում է Իսահակյանի <<Ծաղիկ էի նորաբողբոջ>> բանաստեղծությունը։Հեռանում է ճեմարանից։Թիֆլիսում Ծանոթանում է Թումանյանի հետ։"
            },
            {
                id: "ai-7",
                year: 1893,
                title: "Կրթությունը",
                lat: 55.80335075793473, lng: 15.252385598230287,
                description: "Ուսումը շարունակելու նպատակով ուղևորվում է Եվրոպա"
            },
            {
                id: "ai-8",
                year: 1896,
                title: "Գործունեությունը",
                lat: 40.19786850652424, lng: 44.51327050583021,
                description: "Իսահակյանը ձերբակալվում է հակացարական գործունեության համար"
            },
            {
                id: "ai-9",
                year: 1897,
                title: "Գործունեությունը",
                lat: 40.80876799079526, lng: 43.845596741613704,
                description: "Ազատվում է և վերադառնում է Ալեքսանդրապոլ"
            },
            {
                id: "ai-10",
                year: 1898,
                title: "Գործունեությունը",
                lat: 40.80976799079526, lng: 43.843596741613704,
                description: "-Լույս է տեսնում Իսահակյանի բանաստեղծությունների անդրանիկ ժողովածուն <<Երգեր ու վերքեր>> խորագրով: "
            },
            {
                id: "a11",
                year: 1898,
                title: "Գործունեությունը",
                lat: 46.47585303737119, lng: 30.717826554225606,
                description: "Գարուն-Շիրվանզադեի հետ աքսորվում է Օդեսա,ցարական ժանդարմերիայի կարգադրությամբ "
            },
            {
                id: "ai-12",
                year: 1893,
                title: "Գործունեությունը",
                lat: 55.80335075793473, lng: 15.252385598230287,
                description: "Ուսումը շարունակելու նպատակով ուղևորվում է Եվրոպա"
            },
            {
                id: "ai-13",
                year: 1899,
                title: "Գործունեությունը",
                lat: 40.29404575547056, lng: 44.605852585896564,
                description: "Վերադարձ հայրենիք"
            },
            {
                id: "ai-14",
                year: 1899,
                title: "Գործունեությունը",
                lat: 41.69236148235229, lng: 44.79848030450787,
                description: "Մասնակցում է <<Վերնատան>> ստեղծմանը"
            },
            {
                id: "ai-15",
                year: 1900,
                title: "Գործունեությունը",
                lat: 47.37508731356411, lng: 8.541195154892904,
                description: "Ցյուրիխում լսում է փիլիսոփայություն և գրականություն"
            },
            {
                id: "ai-16",
                year: 1901,
                title: "Գործունեությունը", 
                lat:45.44525549352727, lng:12.324647192504361,
                description: "Այցելում է մխիթարյան միաբանություն"
            },
            {
                id: "ai-17",
                year: 1902,
                title: "Գործունեությունը", 
                lat: 40.4099572657879, lng: 49.860460078403,
                description: "Հրատարակվում է Իսահակյանի բանաստեղծությունների II ժողովածուն՝<<Հին-նոր երգեր ու վերքեր>> վերնագրով"
            },
            {
                id: "ai-18",
                year: 1903,
                title: "Գործունեությունը",
                lat: 41.4099572657879, lng: 49.860460078403,
                description: "Հրապարակվում է Իսահակյանի ժողովածուն <<Բանաստեղծություններ>> խորագրով,նվիրված մորը՝ Ալմաստ Իսահակյանին։"
            },
            {
                id: "ai-90",
                year: 1904,
                title: "Գործունեությունը", 
                lat: 55.761266230114465, lng: 37.631284877601146,
                description: "Այցելում է Լազարյան ճեմարան,որտեղ ծանոթանում է Տերյանի հետ։"
            },
            {
                id: "ai-19",
                year: 1906,
                title: "Գործունեությունը", 
                lat: 40.959848303918314, lng: 44.64982244402602,
                description: "Թումանյանի հետ շրջագայում են Լոռվա սարերում։ "
            },
            {
                id: "ai-20",
                year: 1907,
                title: "Գործունեությունը",
                lat: 55.861266230114465, lng: 37.631284877601146,
                description: "Լույս է տեսնում Իսահակյանի բանաստեղծությունների գրքույկը <<Цветы Араза>> վերնագրով։ "
            },
            {
                id: "ai-21",
                year: 1908,
                title: "Գործունեությունը", 
                lat: 40.408067261101856, lng: 49.84833587361979,
                description: "Ստանձնում տեղի Հայոց Կուլտուրական Միության Հրատարակչության մասի վարչի պարտականությունները։"
            },
            {
                id: "ai-22",
                year: 1908,
                title: "Գործունեությունը",
                lat: 41.69155984682776,  lng: 44.812235569827415,
                description: "Ձերբակալվում է և փակվում Թիֆլիսի Մետեխի բանտում"
            },
            {
                id: "ai-23",
                year: 1909,
                title: "Գործունեությունը",
                lat:  40.80982202214281, lng: 43.82622583468479,
                description: "Ազատվում է բանտից,ամուսնանում է Սոֆիկ Քոչարյանի հետ"
            },
            {
                id: "ai-24",
                year: 1911,
                title: "Գործունեությունը",
                lat: 41.01956329412316, lng: 28.934551666757265,
                description: "Առաջին անգամ լրիվ հրատարակվում է <<Աբու-Լալա Մահարին>>"
            },
            {
                id: "ai-25",
                year: 1912,
                title: "Գործունեությունը",
                lat:48.23682441196883, lng: 16.450470827039627,
                description: ""
            },
            {
                id: "ai-26",
                year: 1913,
                title: "Գործունեությունը",
                lat: 46.203991018450324, lng: 6.144582995565858,
                description: ""
            },
            {
                id: "ai-27",
                year: 1914,
                title: "Գործունեությունը",
                lat:52.529784768641754, lng:13.375243178633227,
                description: ""
            },
            {
                id: "ai-28",
                year: 1919,
                title: "Գործունեությունը",
                lat:40.79357359686377, lng:43.83695829627195,
                description: "Գրում է <<Սասմա Մհեր>> վիպերգը"
            },
            {
                id: "ai-29",
                year: 1920,
                title: "Գործունեությունը",
                lat: 46.303991018450324, lng: 6.144582995565858,
                description: "Ժնևում հրապարակվում է բանաստեղծությունների ժողովածուն՝<<Հայրենի աղբյուր>> խորագրով։"
            },
            {
                id: "ai-30",
                year: 1921,
                title: "Գործունեությունը",
                lat: 45.44105309435733, lng: 12.317880547658863,
                description: ""
            },
            {
                id: "ai-31",
                year: 1922,
                title: "Գործունեությունը",
                lat: 45.45105309435733, lng: 12.317880547658863,
                description: "Հրատարակվում է <<Աշնան ծաղիկներ>> ժողովածուն և <<Սասմա Մհեր>> վիպերգը"
            },
            
            {
                id: "ai-34",
                year: 1927,
                title: "Գործունեությունը",
                lat:41.735919899651236, lng:44.80797639876499,
                description: "Լույս է տեսնում <<Լիլիթ.արևելյան տեսիլներ>> ժողովածուն"
            },
            {
                id: "ai-35",
                year: 1932,
                title: "Գործունեությունը",
                lat:48.88253709020276, lng: 2.3291778680753645,
                description: "Լույս է տեսնում <<Լիլիթ.արևելյան տեսիլներ>> ժողովածուն"
            },
            {
                id: "ai-35",
                year: 1936,
                title: "Գործունեությունը",
                lat:40.173738429546596, lng:44.4851180411138,
                description: "դեկտեմբերի5 -> Երևան"
            },
            {
                id: "ai-36",
                year: 1943,
                title: "Գործունեությունը",
                lat: 40.202588604525175, lng: 44.46795190409159,
                description: "Ընտրվում է Հայկական ՍՍՌ գիտությունների ակադեմիայի անդամ։"
            },
            {
                id: "ai-37",
                year: 1945,
                title: "Գործունեությունը",
                lat:40.2104547042802, lng:44.42263330235296,
                description: "Պարգևատրվում է Լենինի շքանշանով։"
            },
            {
                id: "ai-38",
                year: 1946,
                title: "Գործունեությունը",
                lat:40.160095893696415, lng:44.47001184053426,
                description: "Ընտրվում է Հայաստանի Սովետական գրողների միության նախագահ:"
            },
            {
                id: "ai-39",
                year: 1949,
                title: "Գործունեությունը",
                lat:40.16219492382989, lng:44.55446923468353,
                description: "Ընտրվում է Սովետական Կոմիտեի անդամ:"
            },
            {
                id: "ai-40",
                year: 1950-1951,
                title: "Գործունեությունը",
                lat:40.13910202332243, lng:44.48580468659469,
                description: "Հրատարակվում է իր I քառահատոր <<Երկերի ժողովածուն>>։"
            },
            {
                id: "ai-40",
                year: 1957,
                title: "Մահ",
                lat:40.16182934954934, lng:44.501755951844956,
                description: "Մահացել է։Թաղված է Երևանի Կոմիտասի անվան պանթեոնում։"
            },
        ]
    },

    {
        id: "aghayan",
        name: "Ղազարոս Աղայան",
        nameEn: "Ghazaros Aghayan",
        color: "#e74c3c",
        bio: "Armenian writer and educator.",
        photo: "ղազար.jpg",
        events: [
            {
                id: "ga-1",
                year: 1840,
                title: "Ծնունդ",
                lat: 41.6938, lng: 44.8015, 
                description: "Ծնվել է Ղազարոս Աղայանը։"
            },
            {
                id: "ga-2",
                year: 1850,
                title: "",
                lat:41.691722519984836, lng:44.756623155629455,
                description: "Աճում է գյուղական միջավայրում, սովորում հորից և գյուղի ուսուցիչներից։ "
            },
            {
                id: "ga-3",
                year: 1853,
                title: "",
                lat:40.65354821852695, lng:43.75163398577885,
                description: "Սկսում է դպրոցական ուսումը, ցուցաբերում հետաքրքրություն լեզուների նկատմամբ։"
            },
            {
                id: "ga-4",
                year: 1857,
                title: "",
                lat:41.7424320984085, lng:44.763787287838525,
                description: "Շարունակում է ուսումը տարբեր դպրոցներում։  "
            },
            {
                id: "ga-5",
                year: 1860,
                title: "",
                lat:41.9424320984085, lng:44.763787287838525,
                description: "Սովորում է արհեստներ՝ դերձակություն, ապա գրաշարություն։"
            },
            {
                id: "ga-6",
                year: 1860,
                title: "Սկսում է գրական գործունեությունը։",
                lat:41.8424320984085, lng:44.763787287838525,
                description: "Սկսում է գրական գործունեությունը։"
            },
            {
                id: "ga-7",
                year: 1866,
                title: "",
                lat:41.75062897232392, lng:44.83107854496559,
                description: "Շարունակում է ինքնակրթությամբ զբաղվել, հավաքում է բանահյուսական նյութեր։"
            },
            {
                id: "ga-8",
                year: 1967,
                title: "",
                lat: 41.6938, lng: 44.8015, // Tbilisi
                description: "Գրում է «Անբախտ Ովսաննա», որը նրան բերում է առաջին լուրջ ճանաչումը։"
            },
            {
                id: "ga-9",
                year: 1869,
                title: "",
                lat:41.7424320984085, lng:44.784386652265184,
                description: "Սկսում է մանկավարժական գործունեություն՝ որպես ուսուցիչ և կազմակերպիչ։"
            },
            {
                id: "ga-10",
                year: 1873,
                title: "",
                lat:41.6624577399231, lng:44.69649603071146,
                description: "Ստեղծում է նոր ստեղծագործություններ, ակտիվ մասնակցում հասարակական կյանքին։ "
            },
            {
                id: "ga-11",
                year: 1874,
                title: "",
                lat:41.722960328751796, lng:44.848931327468684,
                description: "Ռուսական իշխանությունների կողմից հետապնդվում է՝ «վտանգավոր մտավորական» լինելու մեղադրանքով։ "
            },
            {
                id: "ga-12",
                year: 1840,
                title: "",
                lat:62.1210470905554, lng:96.43499435819004,
                description: "Կալանավորվում է, դատվում և աքսորվում։"
            },
            {
                id: "ga-13",
                year: 1880,
                title: " ",
                lat:59.21929636782529, lng:39.88001567009237,
                description: "Վեց տարի անցկացում է աքսորում․ գրում է, թարգմանում, ուսումնասիրում լեզվաբանություն և ժողովրդական մշակույթ։ "
            },
            {
                id: "ga-14",
                year: 1885,
                title: "",
                lat:41.7071029326375, lng:44.81430137602406,
                description: "Վերադառնում է Անդրկովկաս, շարունակում մանկավարժական և գրական աշխատանքը։ "
            },
            {
                id: "ga-15",
                year: 1895,
                title: "",
                lat:41.72965421699572, lng:44.72160423610413,
                description: "Ստեղծում է իր առավել հայտնի գործերը՝ «Անահիտ», «Աղաբեկ», «Արծվիկ» և այլն։ "
            },
            {
                id: "ga-16",
                year: 1890,
                title: "",
                lat:41.7322163622185, lng:44.79782188448275,
                description: "Հավաքում է հայկական հեքիաթներ, առածներ, ժողովրդական երգեր։"
            },
            {
                id: "ga-17",
                year: 1890,
                title: "",
                lat:41.69069702835308, lng:44.74289024601166,
                description: "Հրատարակում է բազմաթիվ մանկավարժական աշխատություններ։ "
            },
            {
                id: "ga-18",
                year: 1910,
                title: "",
                lat:41.67274827850281, lng:44.72160423610413,
                description: "Աշխատում է ինքնակենսագրական նյութերի, վերջին պատմվածքների ևուսումնասիրությունների վրա։ "
            },
            {
                id: "ga-19",
                year: 1911,
                title: "",
                lat:41.7583444060454, lng:44.72572410898945,
                description: "Մահանում է՝ թողնելով մեծ գրական ու մանկավարժական ժառանգություն։ "
            }
        ]
    },

    {
        id: "shant",
        name: "Լևոն Շանթ",
        nameEn: "Levon Shant",
        color: "#9b59b6",
        bio: "Armenian playwright and novelist.",
        photo: "լյով.jpg",
        events: [
            {
                id: "ls-1",
                year: 1869,
                title: "Ծնունդ",
                lat: 41.0082, lng: 28.9784, 
                description: "Լևոն Շանթը(Նահաշպետյան,Սեղբոսյան) ծնվել է 1869թ. Ապրիլի 6-ին Կ.Պոլսում՝գորգի վաճառականի ընտանիքում։"
            },
            {
                id: "ls-14",
                year: 1880,
                title: "",
                lat:41.02208775561094, lng:28.947886704416717,
                description: "Նախնական կրթություն - Սկյուտարի Սուրբ Կարապետ եկեղեցու վարժարան - Սկուտարի ճեմարան (վայր՝Կ.Պոլիս)"
            },
            {
                
                id: "ls-15",
                year: 1884,
                title: "",
                lat:40.162175547537295, lng:44.29363894020139,
                description: "Գևորգյան ճեմարան "
            },
            {
                
                id: "ls-16",
                year: 1892,
                title: "",
                lat:48.15038278288663, lng:11.567001985805375,
                description: " Լայպցիգի,Ենայի,Մյունխենի համալսարաններ "
            },
            {
                
                id: "ls-17",
                year: 1898,
                title: "",
                lat:40.33601857424753, lng:44.52067985041319,
                description: "ՎԵՐԱԴԱՐՁ ԿՈՎԿԱՍ"
            },
            {
                
                id: "ls-18",
                year: 1899,
                title: "",
                lat:41.73730852078407, lng:44.8008661438065,
                description: "Վերնատան հիմնադիրներից և անդամներից մեկը դառնում"
            },
            {
                
                id: "ls-19",
                year: 1900,
                title: "",
                lat:46.86500287597551, lng:8.240387427821414,
                description: "Շվեյցարիայում հանդիպում է ապագա կնոջը՝ Ջավահիր Ներսիսյանին, 1903-ին ամուսնանում։"
            },
            {
                
                id: "ls-20",
                year: 1900,
                title: "",
                lat:41.673774056217205, lng:44.83215415852716,
                description: "տեսուչ Գայանյան դպրոցում - վայր՝ Թիֆլիս Թումանյանի և Լիսիցյանի հետ հրապարակում է «Լուսաբեր» դասագիրքը։"
            },
            {
                
                id: "ls-21",
                year: 1908,
                title: "",
                lat:40.19000094630547, lng:44.478251586304914,
                description: "Որպես թեմական դպրոցի ուսուցիչ։"
            },
            {
                
                id: "ls-22",
                year: 1908,
                title: "",
                lat: 41.0082, lng: 28.9774,
                description: "Դասավանդում է Եսայան օրիորդաց և Կեդրոնական վարժարաններում:"
            },
            {
                
                id: "ls-23",
                year: 1913,
                title: "",
                lat:54.49770620136083, lng:14.549260625800546,
                description: "«Հին աստվածներ» դրամայի հաջողության շնորհիվ մեկնում է Եվրոպա, փրկվում է Եղեռնից։"
            },
            {
                
                id: "ls-24",
                year: 1918,
                title: "",
                lat:40.14015187095198, lng:44.51739037871555,
                description: "Ընտրվում է Հայաստանի առաջին Հանրապետության խորհրդարանի  փոխնախագահ։"
            },
            {
                
                id: "ls-25",
                year: 1920,
                title: "",
                lat:40.14015187095198, lng:44.52739037871555,
                description: " Բոլշևիկների հետ բանակցելու մեկնող պատվիրակության ղեկավար։"
            },
            {
                
                id: "ls-26",
                year: 1920,
                title: "",
                lat:40.14015187095198, lng:44.52639037871555,
                description: "Նույն թվականին՝ 1920 թ.-ին բանտարկվում"
            },
            {
                
                id: "ls-27",
                year: 1921,
                title: "",
                lat:35.72641626809355, lng:51.32085930265932,
                description: "դուրս է գալիս բանտից Նիկոլ Աղբալյանի հետ։Հասնում է Զանգեզուր-»Մեղրի -» Պարսկաստանի Թավրիզ քաղաք -» Թեհրան"
            },
            {
                
                id: "ls-28",
                year: 1930,
                title: "",
                lat:33.89300759629155, lng:35.50726983597706,
                description: "Նիկոլ Աղբալյանի հետ հիմնում են Համազգային հայ ճեմարանը։"
            },

            {

                id: "ls-29",
                year: 1951,
                title: "Մահ",
                lat: 33.8938, lng: 35.5018, // Beirut
                description: "Նոյեմբերի 29-ին 82 տարեկան հասակում,Բեյրութում վախճանվում է Լևոն Շանթը։"
            }
        ]
    },

    {
        id: "tumanyan",
        name: "Հովհաննես Թումանյանն",
        nameEn: "Հովհաննես Թումանյան",
        color: "green",
        bio: "Armenian writer.",
        photo: "hovo.jfif",
        events: [
            {
                id: "dd-1",
                year: 1869,
                title: "Ծնունդ",
                lat:40.96515215572921, lng:44.65165592445659,
                description: "Հովհաննես Թումանյանը ծնվել է 1869 թվականի փետրվարի 19-ին Լոռվա Դսեղ գյուղում:"
            },
            {
                id: "dd-2",
                year: 1877,
                title: "Սկզբնական կրթություն",
                lat:40.9580873265179, lng:44.64478946964771,
                description: "Սովորել է Դսեղի ծխական դպրոցում"
            },
            {
                id: "dd-3",
                year: 1879,
                title: "Գրական առաջին փորձերը",
                lat:41.007775516092224, lng:44.376256673365006,
                description: "Սովորել է Ջալալօղլու (այժմ Ստեփանավան) նորաբաց երկսեռ դպրոցում:"
            },
            {
                id: "dd-4",
                year: 1883,
                title: "Բարձրագույն կրթություն Ժնևում",
                lat:41.70761554970726, lng:44.917298198157326,
                description: "Սովորել է Թիֆլիսի Ներսիսյան դպրոցում:"          
            },
            {
                id: "dd-5",
                year: 1887,
                title: "Վերադարձ Թիֆլիս և ակտիվ գրականություն",
                lat:41.750660791022256, lng:44.83970725881694,
                description: "Նյութական ծանր դրության պատճառով 1887 թվականին կիսատ թողնելով ուսումը՝ աշխատել է Թիֆլիսի հայ եկեղեցական դատարանում, այնուհետև Հայ Հրատարակչական միության գրասենյակում (մինչև 1893 թ․)  "
            },
            {
                id: "dd-6",
                year: 1899,
                title: "Տեղափոխություն Հայաստան (Երևան)",
                lat:40.134377508250125, lng:44.52631676996711,
                description: "Դեմիրճյանը վերջնականորեն տեղափոխվում է Երևան։ Սա նրա կյանքի ամենաբեղուն փուլերից մեկն է։ Հայաստանում նա ընդգրկվում է գրական միությունների, մշակութային հանձնաժողովների աշխատանքներին, գրում է նոր վեպեր («Երկիր Նաիրի»), դրամաներ և ակնարկներ։ Այստեղ նա դառնում է այն հեղինակներից մեկը, որ ձեւավորում է նորաստեղծ խորհրդային Հայաստանի գրական միջավայրը։" 
            },
            {
                id: "dd-7",
                year: 1905,
                title: "",
                lat:40.202136625689116, lng:44.50287244732561,
                description: "1899 թ․ բանաստեղծը կազմակերպում է «Վերնատուն» գրական խմբակը։ Հանդիպումների ժամանակ քննարկում վերլուծում էին համաշխարհային արժեք ունեցող ստեղծագործություններ, միմյանց գրվածքները և այլն։ " 
            },
            {
                id: "dd-8",
                year: 1912,
                title: "    ",
                lat:40.17571539470449, lng:44.50541269489123,
                description: "1912-1921 թվականներին եղել է Հայ գրողների կովկասյան միության նախագահ։ Հայաստանի խորհրդայնացումից հետո նախագահել է Հայաստանի օգնության կոմիտեն:" 
            },
            {
                id: "dd-9",
                year: 1915,
                title: "    ",
                lat:40.15566731543516, lng:44.28339853511428,
                description: "Ցեղասպանության ժամանակ ստանձնում է փախստականներին օգնելու կազմակերպումը։Ղեկավարում է կոմիտեներ, որբերի տեղաբաշխում, սնունդ, բուժման կազմակերպում։" 
            },
            {
                id: "dd-11",
                year: 1918,
                title: "    ",
                lat:40.21464958423345, lng:44.47481835890048,
                description: "Մասնակցում է ազգային հարցերի լուծման աշխատանքներին։ Միաժամանակ շարունակում էգրական գործունեությունը ու թարգմանությունները։" 
            },
            {
                id: "dd-12",
                year: 1921,
                title: "    ",
                lat:41.02246778982733, lng:29.003877411953276, 
                description: "1921 թվականի աշնանը Թումանյանը մեկնել է Կոստանդնուպոլիս՝ հայ գաղթականների համար օգնություն գտնելու նպատակով։ Մի քանի ամիս մնալով այնտեղ՝ նա վերադառնում է հիվանդացած։" 
            },
            {
                id: "dd-13",
                year: 1923,
                title: "    ",
                lat:55.853002823514146, lng:37.41984324552326,
                description: "Մահացել է 1923 թվականին՝ Մոսկվայում " 
            }
        ]
    },

    {
        id: "demirchyan",
        name: "Դերենիկ Դեմիրճյան",
        nameEn: "Derenik Demirchyan",
        color: "#f39c12",
        bio: "Armenian writer.",
        photo: "images.webp",
        events: [
            {
                id: "dd-1",
                year: 1877,
                title: "Ծնունդը",
                lat: 41.0775, lng: 43.4729, // Akhalkalaki
                description: "Դերենիկ Դեմիրճյանը ծնվել է 1877 թ. Ախալքալաք քաղաքում, Ջավախքում, այն ժամանակ՝ Ռուսաստանի կայսրության կազմում գտնվող հայկական կենտրոններից մեկում։ Նրա ընտանիքն աչքի էր ընկնում կրթվածությամբ, ինչը մեծ ազդեցություն ունեցավ ապագա գրողի ձևավորման վրա։"
            },
            {
                id: "dd-2",
                year: 1880,
                title: "Սկզբնական կրթություն",
                lat: 41.0775, lng: 43.4729, // Akhalkalaki
                description: "Նա սկզբնական կրթությունը ստացել է իր ծննդավայրում, իսկ ընտանիքի տեղափոխվելուց հետո ուսումնը շարունակել է Թիֆլիսում՝ այն ժամանակվա հայկական մշակութային ամենաակտիվ կենտրոններից մեկում։ Այստեղ նա ծանոթացավ հայ գրականության նոր ուղղություններին և մտավորական շրջանակներին, որոնք ձևավորեցին նրա գրական ճաշակը։"
            },
            {
                id: "dd-3",
                year: 1894,
                title: "Գրական առաջին փորձերը",
                lat: 41.6938, lng: 44.8015, // Tbilisi
                description: "Դեռ պատանի տարիներին՝ 1890-ականների կեսերին, Դեմիրճյանը սկսում է գրել բանաստեղծություններ և փոքր արձակ գործեր։ Նրա առաջին ստեղծագործությունները տպագրվում են Թիֆլիսի գրական մամուլում։ Այս տարիները նրա գրական կյանքի սկիզբն են։"
            },
            {
                id: "dd-4",
                year: 1900,
                title: "Բարձրագույն կրթություն Ժնևում",
                lat: 46.2044, lng: 6.1432, // Geneva, Switzerland
                description: "Դեմիրճյանի կյանքի կարևոր շրջադարձերից էր նրա մեկնումը Ժնև, որտեղ նա ուսանում է Ժնևի համալսարանում։ Այստեղ նա խորանում է փիլիսոփայության, գրականության և հասարակական գիտությունների մեջ։ Ժնևի ազատ մտավոր միջավայրը մեծ ազդեցություն ունեցավ նրա աշխարհայացքի, ազգային մտքի և գրական ոճի ձևավորման վրա։"
            },
            {
                id: "dd-5",
                year: 1905,
                title: "Վերադարձ Թիֆլիս և ակտիվ գրականություն",
                lat: 41.6938, lng: 44.8015, // Tbilisi
                description: "Բուհը ավարտելուց հետո նա վերադառնում է Թիֆլիս։ Այս շրջանը նշանավորվում է հասարակական-քաղաքական շարժումների ակտիվությամբ, և Դեմիրճյանը նույնպես ներգրավվում է մշակութային կյանքում։ Նա գրում է բանաստեղծություններ, պատմվածքներ, աշխատում թերթերում, դասավանդում և մասնակցում քաղաքացիական նախաձեռնություններին։"
            },
            {
                id: "dd-6",
                year: 1925,
                title: "Տեղափոխություն Հայաստան (Երևան)",
                lat: 40.1792, lng: 44.4991, // Yerevan
                description: "Դեմիրճյանը վերջնականորեն տեղափոխվում է Երևան։ Սա նրա կյանքի ամենաբեղուն փուլերից մեկն է։ Հայաստանում նա ընդգրկվում է գրական միությունների, մշակութային հանձնաժողովների աշխատանքներին, գրում է նոր վեպեր («Երկիր Նաիրի»), դրամաներ և ակնարկներ։ Այստեղ նա դառնում է այն հեղինակներից մեկը, որ ձեւավորում է նորաստեղծ խորհրդային Հայաստանի գրական միջավայրը։"
            },
            {
                id: "dd-7",
                year: 1956,
                title: "Մահ",
                lat: 40.1792, lng: 44.4991, // Yerevan
                description: "Դերենիկ Դեմիրճյանը մահանում է 1956 թ. Երևանում՝ թողնելով հսկայական գրական ժառանգություն։ Նրա անունով այսօր կոչվում են դպրոցներ, գրադարաններ, փողոցներ։ Նա թաղված է Երևանում՝ Կոմիտասի պանթեոնում։"
            },
            {
                id: "dd-8",
                year: 1960,
                title: "Ընտրություն Գիտությունների Ակադեմիայի ակադեմիկոս",
                lat: 40.1792, lng: 44.4991, // Yerevan
                description: "Թեև սա տեղի ունեցավ մահից հինգ տարի անց, Դեմիրճյանը դարձավ Հայաստանի Գիտությունների Ակադեմիայի ակադեմիկոս՝ իր գրական և գիտական վաստակի համար։"
            }
        ]
    }
];
